$(window).resize(function () {
  window.location.reload();
});
//---------------------------------------
$('#profile').css({height:$('#home').height()})

var load_hight=$(window).height();

$('.load_1>div').css({height:load_hight})
//--------------------------------------
var tops = -40;

setTimeout(() => {
  setInterval(() => {
    $(".top_4>div").css({
      top: tops
    })
    tops -= 40;
    if (tops < -90) {
      tops = 0;
    }
  }, 2000);
}, 800);

//-------------------
$(".pc_news>div:nth-child(2)>div").mouseover(function () {
  $(".top_3>div>.swiper-container>.swiper-wrapper").css({
    transition: "all 0.8s "
  })
  var index_news = $(this).index();
  var width_news = $(".swiper-container2>.swiper-wrapper>.swiper-slide").width();
  $('.swiper-pagination-current').html(index_news + 1);
  $(".top_3>div>.swiper-container>.swiper-wrapper").css({
    transform: "translate3d(" + -width_news * index_news + "px,0,0)"
  });
});

$(".pc_news>div:nth-child(2)>div").mouseleave(function () {
  $(".top_3>div>.swiper-container>.swiper-wrapper").css({
    transition: "all 0s "
  })
});
//--------------------------------------------


//---------------------------------
$('.swiper-video').click(function (e) {
  e.preventDefault();
  var a = $('video').hasClass("play");
  if (a) {
    $('video').get(0).pause();
    $('video').removeClass("play");
    $(".swiper-video>.fa-3x").fadeIn();
  } else {
    $('video').get(0).play();
    $('video').addClass("play");
    $(".swiper-video>.fa-3x").fadeOut();
  }

});
//----------------------------------


//----------------------------
var scroll_top = $(document).scrollTop();
var img_top_width = $(".top_1").height();
if (scroll_top >= img_top_width + 57.6) {
  $('.tabs').addClass("fix-top");
} else {
  $('.tabs').removeClass("fix-top")
}

$(document).scroll(function () {
  scroll_top = $(document).scrollTop();

  img_top_width = $(".top_1").height();
  if (scroll_top >= img_top_width + 57.6) {
    $('.tabs').addClass("fix-top");

  } else {
    $('.tabs').removeClass("fix-top")
  }
});
//----------------------------------------
$('#yao_btn').click(function () {

  var timer_1 = setTimeout(() => {
    $(".container-geng>div").show();
    $(".container-geng>span").html("");
  }, 3000);
  var so_num = $("#yao_so").val();
  $(".container-geng>div").hide();
  $(".container-geng>span").html("尚未发现" + "\"" + so_num + "\"" + "相关的谣言" + "<br>" + "<small>三秒后返回主界面" + "<br>" + "等不及?点我立即返回</small>")



  $(".container-geng>span").click(function () {
    clearTimeout(timer_1);
    $(".container-geng>div").show();
    $(".container-geng>span").html("");
  })
})
var page_width = $(document).width();
if (page_width >= 768) {
  var left_to_page2 = ($('.pc_heng>div').width() - 318) / 2;
  $('.swiper-button-prev1,.swiper-button-prev2').css({
    left: left_to_page2 + 10
  })
  $('.swiper-button-next1,.swiper-button-next2').css({
    right: left_to_page2 + 10
  })
}
//----------------------------------------------------------------------------------------------
//由于是本地页面，为了节约时间，也为了尽量优化用户体验，所以省区选择范围为全国，市区范围为每个省的随机四个市区
var pro = ["河南", "山东", "黑龙江", "河北","湖北","香港","台湾","北京",
"广东","上海","甘肃","浙江","福建","陕西","澳门","四川","江苏",
"广西","云南","辽宁","江西","海南","天津","湖南","安徽","重庆",
"贵州","山西","吉林","新疆","宁夏","内蒙古","青海","西藏"];
var city = [
  ["郑州", "开封", "新政", "濮阳"],
  ["济南", "日照", "烟台", "德州", "聊城"],
  ["哈尔滨", "齐齐哈尔", "佳木斯", "牡丹江"],
  ["唐山", "沧州", "张家口", "保定"],
  ["武汉", "孝感", "鄂州", "随州"],
  ["香港"],
  ["台湾"],
  ["朝阳区", "海淀区", "西城区", "丰台区"],
  ["广州", "深圳", "佛山", "中山"],
  ["宝山区", "嘉定区", "浦东新区", "徐汇区"],
  ["兰州", "天水", "平凉", "定西"],
  ["丽水", "温州", "杭州", "嘉兴"],
  ["福州", "莆田", "泉州", "厦门"],
  ["西安", "咸阳", "延安", "宝鸡"],
  ["澳门"],
  ["成都", "达州", "南充", "广安"],
  ["苏州", "宿迁", "南京", "徐州"],
  ["南宁", "北海", "桂林", "玉林"],
  ["昆明", "昭通", "西双版纳", "玉溪"],
  ["沈阳", "大连", "锦州", "葫芦岛"],
  ["南昌", "新余", "九江", "宜春"],
  ["海口", "三亚", "瞻洲", "万宁"],
  ["河东区", "河北区", "南开区", "和平区"],
  ["长沙", "岳阳", "益阳", "衡阳"],
  ["合肥", "阜阳", "毫州", "黄山"],
  ["万州区", "江北区", "云阳区", "合川区"],
  ["贵阳", "遵义", "毕节", "六盘水"],
  ["晋中", "太原", "运城", "大同"],
  ["长春", "四平市", "公主岭", "吉林市"],
  ["乌鲁木齐", "伊犁州", "兵团第八师石河子市", "兵团第六师五家渠市"],
  ["银川", "吴忠", "固原", "中卫"],
  ["鄂尔多斯", "包头", "赤峰", "呼和浩特"],
  ["西宁", "海北州"],
  ["拉萨"],

];
//分别是各个市区确诊，救助，死亡信息（由于才学完前端，所以数据还是本地的，所以数据可能不准确，望老师见谅）
var xin_xi = [
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],
  [
    [0, 157, 5, 152],
    [0, 26, 0, 26],
    [2,24,0,29],
    [0,58,0,59],
  ],

]
$(function () {
  //初始化省份下拉列表
  for (var i = 0; i < pro.length; i++) {
    $("#province").append($("<option></option>").val(i + 1).html(pro[i]));
  }
  //为省份下拉列表绑定change事件
  $("#province").change(function () {
   
    var index = $(this).val() - 1; //获取当前省的下标
    $("#city").prop("length", 1); //清空原有的数据
    for (var i = 0; i < city[index].length; i++) { //重新为市赋值
      $("#city").append($("<option>").val(i + 1).html(city[index][i]));
    }
  });
})
function pan_duan(selected2, selected1) {
  switch (selected2) {
    case 1:
      $('.shi_cha_jie>div').html(
        "您要查询的地区为:" + pro[selected1 - 1] + city[selected1 - 1][selected2 - 1] + "<br>" +
        "------------------" + "<br>" +
        "该区疫情情况为：" + "<br>" +
        "现存确诊" + xin_xi[selected1 - 1][selected2 - 1][0] + "名<br>" +
        "累计确诊" + xin_xi[selected1 - 1][selected2 - 1][1] + "名<br>" +
        "治愈" + xin_xi[selected1 - 1][selected2 - 1][2] + "名<br>" +
        "死亡" + xin_xi[selected1 - 1][selected2 - 1][3] + "名")
      break;
    case 2:
      $('.shi_cha_jie>div').html(
        "您要查询的地区为:" + pro[selected1 - 1] + city[selected1 - 1][selected2 - 1] + "<br>" +
        "------------------" + "<br>" +
        "该区疫情情况为：" + "<br>" +
        "现存确诊" + xin_xi[selected1 - 1][selected2 - 1][0] + "名<br>" +
        "累计确诊" + xin_xi[selected1 - 1][selected2 - 1][1] + "名<br>" +
        "治愈" + xin_xi[selected1 - 1][selected2 - 1][2] + "名<br>" +
        "死亡" + xin_xi[selected1 - 1][selected2 - 1][3] + "名")
      break
    case 3:
      $('.shi_cha_jie>div').html(
        "您要查询的地区为:" + pro[selected1 - 1] + city[selected1 - 1][selected2 - 1] + "<br>" +
        "------------------" + "<br>" +
        "该区疫情情况为：" + "<br>" +
        "现存确诊" + xin_xi[selected1 - 1][selected2 - 1][0] + "名<br>" +
        "累计确诊" + xin_xi[selected1 - 1][selected2 - 1][1] + "名<br>" +
        "治愈" + xin_xi[selected1 - 1][selected2 - 1][2] + "名<br>" +
        "死亡" + xin_xi[selected1 - 1][selected2 - 1][3] + "名")
      break
    case 4:
      $('.shi_cha_jie>div').html(
        "您要查询的地区为:" + pro[selected1 - 1] + city[selected1 - 1][selected2 - 1] + "<br>" +
        "------------------" + "<br>" +
        "该区疫情情况为：" + "<br>" +
        "现存确诊" + xin_xi[selected1 - 1][selected2 - 1][0] + "名<br>" +
        "累计确诊" + xin_xi[selected1 - 1][selected2 - 1][1] + "名<br>" +
        "治愈" + xin_xi[selected1 - 1][selected2 - 1][2] + "名<br>" +
        "死亡" + xin_xi[selected1 - 1][selected2 - 1][3] + "名")
      break
  }
}

$('.shi_cha').click(function () {
  var selected1 = $("#province  option:selected").index();
  var selected2 = $("#city  option:selected").index();
  console.log(selected1);
  if (selected1 == 0) {
    alert('请选择您要查询的省')
  } else if (selected2 == 0) {
    alert('请选择您要查询的市')
  } else {
    pan_duan(selected2,selected1);
  }

})
//----------------------------------------------------------
var world_yi=[
  //欧洲
  [
    ['意大利',54030,69176,6820,8326],
    ['西班牙',38809,47610,3434,8326],
    ['德国',32266,35743,187,3290],
    ['法国',54030,69176,6820,8326],
    ['瑞士',54030,69176,6820,8326],
    ['瑞士',54030,69176,6820,8326],
    ['英国',54030,69176,6820,8326],
    ['荷兰',54030,69176,6820,8326],
    ['奥地利',54030,69176,6820,8326],
    ['比利时',54030,69176,6820,8326],
    ['挪威',54030,69176,6820,8326],
    ['葡萄牙',54030,69176,6820,8326]  
  ],
  //北美洲
  [
    ['美国',54030,69176,6820,8326],
    ['加拿大',54030,69176,6820,8326],
    ['巴拿马',54030,69176,6820,8326],
    ['墨西哥',54030,69176,6820,8326],
    ['多米尼加',54030,69176,6820,8326],
    ['哥斯达黎加',54030,69176,6820,8326],
    ['挂德罗普岛',54030,69176,6820,8326],
    ['特立尼达和多巴哥',54030,69176,6820,8326],
    ['马提尼克',54030,69176,6820,8326],
    ['洪都拉斯',54030,69176,6820,8326],
    ['古巴',54030,69176,6820,8326],
    ['波多黎各',54030,69176,6820,8326]
  ],
  //亚洲
  [
    ['伊朗',54030,69176,6820,8326],
    ['韩国',54030,69176,6820,8326],
    ['中国',54030,69176,6820,8326],
    ['土耳其',54030,69176,6820,8326],
    ['以色列',54030,69176,6820,8326],
    ['马拉西亚',54030,69176,6820,8326],
    ['巴基斯坦',54030,69176,6820,8326],
    ['日本',54030,69176,6820,8326],
    ['沙特阿拉伯',54030,69176,6820,8326],
    ['泰国',54030,69176,6820,8326],
    ['印度尼西亚',54030,69176,6820,8326],
    ['菲律宾',54030,69176,6820,8326]
  ],
  //南美洲
  [
    ['巴西',54030,69176,6820,8326],
    ['厄瓜多尔',54030,69176,6820,8326],
    ['智利',54030,69176,6820,8326],
    ['秘鲁',54030,69176,6820,8326],
    ['格伦比亚',54030,69176,6820,8326],
    ['阿根廷',54030,69176,6820,8326],
    ['乌拉圭',54030,69176,6820,8326],
    ['委内瑞拉',54030,69176,6820,8326],
    ['巴拉圭',54030,69176,6820,8326],
    ['玻利维亚',54030,69176,6820,8326],
    ['瓦亚那',54030,69176,6820,8326],
    ['圭亚那',54030,69176,6820,8326]
  ],
  //大洋洲
  [
    ['澳大利亚',54030,69176,6820,8326],
    ['新西兰',54030,69176,6820,8326],
    ['关岛',54030,69176,6820,8326],
    ['波利尼西亚',54030,69176,6820,8326],
    ['克里多尼亚',54030,69176,6820,8326],
    ['斐济',54030,69176,6820,8326],
    ['巴布亚新几内亚',54030,69176,6820,8326],
  ],
  //非洲
  [
    ['南非',54030,69176,6820,8326],
    ['埃及',54030,69176,6820,8326],
    ['阿尔及利亚',54030,69176,6820,8326],
    ['摩洛哥',54030,69176,6820,8326],
    ['突尼斯',54030,69176,6820,8326],
    ['布基纳法索',54030,69176,6820,8326],
    ['留尼旺',54030,69176,6820,8326],
    ['塞内加尔',54030,69176,6820,8326],
    ['科特迪瓦',54030,69176,6820,8326],
    ['喀麦隆',54030,69176,6820,8326],
    ['刚果',54030,69176,6820,8326],
    ['毛里求斯',54030,69176,6820,8326]
  ],
]
$('.world_table>tbody>tr').eq(0).find('i').css({transform:'rotate(90deg)'});

$('.world_table>tbody>tr').click(function () {
  $(this).siblings().find('i').css({transform:'rotate(0deg)'});
  $(this).find('i').css({transform:'rotate(90deg)'})
  $('.new_geng').remove()
  var world_tr='';
  var this_index=$(this).index();
  
    for (let a = 0; a < world_yi[this_index].length; a++) {
      world_tr+='<tr class="new_geng">'
      for (let b = 0; b < world_yi[this_index][a].length; b++) {
        world_tr+='<td>'+world_yi[this_index][a][b]+'</td>' 
      }
      world_tr+='</tr>'
    }
  $(this).after(world_tr);
  
})
//-----------------------------------------------------------------------------------------
